/* eslint-disable @typescript-eslint/no-explicit-any */
"use client";

import { useEffect } from "react";
import Questions from "../pricing/_components/Questions";
import Image from "next/image";
import cont1 from "../assets/cont1.png";
import cont2 from "../assets/cont2.png";
import cont3 from "../assets/cont3.png";
import cont4 from "../assets/cont4.png";
import cont5 from "../assets/cont5.png";
import cont6 from "../assets/cont6.png";

export default function ContactSales() {
  useEffect(() => {
    const scriptSrc = "https://tally.so/widgets/embed.js";

    if (!document.querySelector(`script[src="${scriptSrc}"]`)) {
      const script = document.createElement("script");
      script.src = scriptSrc;
      script.async = true;
      script.onload = () => {
        if ((window as any).Tally) {
          (window as any).Tally.loadEmbeds();
        } else {
          document
            .querySelectorAll("iframe[data-tally-src]:not([src])")
            .forEach((e) => {
              e.setAttribute("src", e.getAttribute("data-tally-src")!);
            });
        }
      };
      document.body.appendChild(script);
    } else {
      if ((window as any).Tally) {
        (window as any).Tally.loadEmbeds();
      }
    }
  }, []);

  return (
    <div dir="rtl" className="pt-[20px]">
      {/* Grid for the main content */}
      <div className="grid grid-cols-1 lg:grid-cols-2 justify-center items-center py-16 lg:py-32 px-4 lg:px-[120px]">
        {/* Left Section */}
        <div className="flex flex-col gap-6 max-sm:px-4">
          <div className="flex flex-col justify-start gap-3">
            <span className="text-[32px] lg:text-[64px] font-semibold">
              تواصل مع
            </span>
            <span className="text-[32px] lg:text-[64px] font-light">
              فريق المبيعات
            </span>
          </div>
          <div className="flex flex-col gap-2">
            <div className="font-normal text-lg lg:text-xl w-full lg:w-3/4 text-[#2a2a2b]">
              اطلب عرض تجريبي مع فريقنا، نناقش فيه سويًا كيف ترفع إنتاجية فريقك
              ونسب الإنجاز في عملك مع مدير.
            </div>
            <div className="pr-8">
              <ul className="list-disc">
                <li className="font-normal text-lg lg:text-xl w-full lg:w-3/4 text-[#2a2a2b]">
                  جولة 30د سريعة عن المنتج
                </li>
                <li className="font-normal text-lg lg:text-xl w-full lg:w-3/4 text-[#2a2a2b]">
                  نصائح عملية لتبسيط عملك
                </li>
                <li className="font-normal text-lg lg:text-xl w-full lg:w-3/4 text-[#2a2a2b]">
                  لمحة كيف توفّر وقت فريقك وتزيد إنتاجيتهم
                </li>
              </ul>
            </div>
          </div>
          <div className="grid grid-cols-2 lg:grid-cols-3 gap-2 w-full lg:w-4/5">
            {[cont1, cont2, cont3, cont4, cont5, cont6].map((img, index) => (
              <div
                key={index}
                className="px-5 py-3 border-2 border-[#FFFFFF99] rounded-[20px]"
              >
                <Image src={img} alt={`cont${index + 1}`} />
              </div>
            ))}
          </div>
        </div>

        {/* Right Section (Tally Form) */}
        <div className="bg-white px-4 lg:px-[50px] pt-10 rounded-[40px] flex self-start mt-8 lg:mt-0">
          <iframe
            data-tally-src="https://tally.so/embed/nr2Nyo?alignLeft=1&hideTitle=1&transparentBackground=1&dynamicHeight=1"
            loading="lazy"
            width="100%"
            height="519"
            title="Early Access - AR"
          ></iframe>
        </div>
      </div>

      <div className="flex flex-col justify-center items-center gap-16 mt-20">
        <div className="m-auto text-6xl font-semibold">لماذا تختار مدير؟</div>
        <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 px-6 sm:px-12 md:px-24 gap-6 sm:gap-10 md:gap-20">
          <div className="flex flex-col gap-4 justify-center items-center">
            <div>
              <svg
                width="31"
                height="34"
                viewBox="0 0 31 34"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_3222_12397)">
                  <g clip-path="url(#clip1_3222_12397)">
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M14.572 5.68799C15.3479 4.83643 16.6879 4.83642 17.4638 5.68799L18.8165 7.17261C18.8899 7.25331 19.0037 7.2838 19.1078 7.25068L21.0215 6.64127C22.1192 6.29172 23.2798 6.96176 23.5259 8.08716L23.955 10.0492C23.9782 10.1559 24.0616 10.2392 24.1682 10.2625L26.1304 10.6916C27.2557 10.9377 27.9258 12.0983 27.5762 13.1959L26.9668 15.1097C26.9337 15.2137 26.9641 15.3275 27.0449 15.401L28.5295 16.7537C29.381 17.5295 29.381 18.8696 28.5295 19.6455L27.0449 20.9981C26.9641 21.0716 26.9337 21.1854 26.9668 21.2895L27.5762 23.2031C27.9258 24.3009 27.2557 25.4614 26.1304 25.7076L24.1682 26.1366C24.0616 26.1599 23.9782 26.2432 23.955 26.3499L23.5259 28.3119C23.2798 29.4374 22.1192 30.1074 21.0215 29.7578L19.1078 29.1485C19.0037 29.1152 18.8899 29.1458 18.8165 29.2265L17.4638 30.7111C16.6879 31.5627 15.3479 31.5627 14.572 30.7111L13.2193 29.2265C13.1459 29.1458 13.032 29.1152 12.928 29.1485L11.0143 29.7578C9.91664 30.1074 8.75611 29.4374 8.50993 28.3119L8.08085 26.3499C8.05752 26.2432 7.97422 26.1599 7.86756 26.1366L5.90553 25.7076C4.78013 25.4614 4.11008 24.3009 4.45964 23.2031L5.06904 21.2895C5.10216 21.1854 5.07167 21.0716 4.99097 20.9981L3.50635 19.6455C2.65478 18.8696 2.65478 17.5295 3.50635 16.7537L4.99097 15.401C5.07167 15.3275 5.10216 15.2137 5.06904 15.1097L4.45964 13.1959C4.11008 12.0983 4.78013 10.9377 5.90553 10.6916L7.86756 10.2625C7.97422 10.2392 8.05752 10.1559 8.08085 10.0492L8.50993 8.08716C8.75611 6.96177 9.91664 6.29172 11.0143 6.64127L12.928 7.25068C13.032 7.2838 13.1459 7.25331 13.2193 7.17261L14.572 5.68799ZM22.2468 15.1949C22.5467 14.7346 22.6194 14.1382 22.2945 13.6952C21.8947 13.1501 21.3896 12.7689 20.9454 12.5119C20.3424 12.1631 19.6198 12.429 19.2186 12.9985C16.7691 16.4764 15.244 18.734 15.244 18.734C15.244 18.734 14.327 17.5938 12.8023 15.9542C12.2733 15.3854 11.4146 15.2714 10.8286 15.7812C10.5117 16.057 10.1676 16.3972 9.86248 16.7897C9.47267 17.2908 9.55511 17.9845 9.95386 18.4786C11.4617 20.3472 12.918 21.8736 13.9601 22.9008C14.8051 23.7337 16.1288 23.6648 16.8721 22.7399C18.007 21.328 19.8253 18.9102 22.2468 15.1949Z"
                      fill="url(#paint0_linear_3222_12397)"
                    />
                  </g>
                </g>
                <defs>
                  <linearGradient
                    id="paint0_linear_3222_12397"
                    x1="16.0179"
                    y1="5.04931"
                    x2="16.0179"
                    y2="31.3498"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#335FFF" />
                    <stop offset="1" stop-color="#2CC171" />
                  </linearGradient>
                  <clipPath id="clip0_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                  <clipPath id="clip1_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <div className="font-semibold text-xl text-[#09090B]">
              عملك في مكان واحد
            </div>
            <div className="text-center font-normal text-base text-[#3F3F46]">
              نظّم مهام فريقك وتابع التقدّم واربط الأهداف والفريق بالرؤية
              الكبيرة، بسهولة ومركزية.
            </div>
          </div>
          <div className="flex flex-col gap-4 justify-center items-center">
            <div>
              <svg
                width="31"
                height="34"
                viewBox="0 0 31 34"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_3222_12397)">
                  <g clip-path="url(#clip1_3222_12397)">
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M14.572 5.68799C15.3479 4.83643 16.6879 4.83642 17.4638 5.68799L18.8165 7.17261C18.8899 7.25331 19.0037 7.2838 19.1078 7.25068L21.0215 6.64127C22.1192 6.29172 23.2798 6.96176 23.5259 8.08716L23.955 10.0492C23.9782 10.1559 24.0616 10.2392 24.1682 10.2625L26.1304 10.6916C27.2557 10.9377 27.9258 12.0983 27.5762 13.1959L26.9668 15.1097C26.9337 15.2137 26.9641 15.3275 27.0449 15.401L28.5295 16.7537C29.381 17.5295 29.381 18.8696 28.5295 19.6455L27.0449 20.9981C26.9641 21.0716 26.9337 21.1854 26.9668 21.2895L27.5762 23.2031C27.9258 24.3009 27.2557 25.4614 26.1304 25.7076L24.1682 26.1366C24.0616 26.1599 23.9782 26.2432 23.955 26.3499L23.5259 28.3119C23.2798 29.4374 22.1192 30.1074 21.0215 29.7578L19.1078 29.1485C19.0037 29.1152 18.8899 29.1458 18.8165 29.2265L17.4638 30.7111C16.6879 31.5627 15.3479 31.5627 14.572 30.7111L13.2193 29.2265C13.1459 29.1458 13.032 29.1152 12.928 29.1485L11.0143 29.7578C9.91664 30.1074 8.75611 29.4374 8.50993 28.3119L8.08085 26.3499C8.05752 26.2432 7.97422 26.1599 7.86756 26.1366L5.90553 25.7076C4.78013 25.4614 4.11008 24.3009 4.45964 23.2031L5.06904 21.2895C5.10216 21.1854 5.07167 21.0716 4.99097 20.9981L3.50635 19.6455C2.65478 18.8696 2.65478 17.5295 3.50635 16.7537L4.99097 15.401C5.07167 15.3275 5.10216 15.2137 5.06904 15.1097L4.45964 13.1959C4.11008 12.0983 4.78013 10.9377 5.90553 10.6916L7.86756 10.2625C7.97422 10.2392 8.05752 10.1559 8.08085 10.0492L8.50993 8.08716C8.75611 6.96177 9.91664 6.29172 11.0143 6.64127L12.928 7.25068C13.032 7.2838 13.1459 7.25331 13.2193 7.17261L14.572 5.68799ZM22.2468 15.1949C22.5467 14.7346 22.6194 14.1382 22.2945 13.6952C21.8947 13.1501 21.3896 12.7689 20.9454 12.5119C20.3424 12.1631 19.6198 12.429 19.2186 12.9985C16.7691 16.4764 15.244 18.734 15.244 18.734C15.244 18.734 14.327 17.5938 12.8023 15.9542C12.2733 15.3854 11.4146 15.2714 10.8286 15.7812C10.5117 16.057 10.1676 16.3972 9.86248 16.7897C9.47267 17.2908 9.55511 17.9845 9.95386 18.4786C11.4617 20.3472 12.918 21.8736 13.9601 22.9008C14.8051 23.7337 16.1288 23.6648 16.8721 22.7399C18.007 21.328 19.8253 18.9102 22.2468 15.1949Z"
                      fill="url(#paint0_linear_3222_12397)"
                    />
                  </g>
                </g>
                <defs>
                  <linearGradient
                    id="paint0_linear_3222_12397"
                    x1="16.0179"
                    y1="5.04931"
                    x2="16.0179"
                    y2="31.3498"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#335FFF" />
                    <stop offset="1" stop-color="#2CC171" />
                  </linearGradient>
                  <clipPath id="clip0_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                  <clipPath id="clip1_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <div className="font-semibold text-xl text-[#09090B]">
              اهتم بالتنفيذ، لا التخطيط
            </div>
            <div className="text-center font-normal text-base text-[#3F3F46]">
              كل الأدوات التي تحتاجها لإنجاز المهام بسلاسة، ادفع فريقك للتركيز
              على ما يهمّ.{" "}
            </div>
          </div>
          <div className="flex flex-col gap-4 justify-center items-center">
            <div>
              <svg
                width="31"
                height="34"
                viewBox="0 0 31 34"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_3222_12397)">
                  <g clip-path="url(#clip1_3222_12397)">
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M14.572 5.68799C15.3479 4.83643 16.6879 4.83642 17.4638 5.68799L18.8165 7.17261C18.8899 7.25331 19.0037 7.2838 19.1078 7.25068L21.0215 6.64127C22.1192 6.29172 23.2798 6.96176 23.5259 8.08716L23.955 10.0492C23.9782 10.1559 24.0616 10.2392 24.1682 10.2625L26.1304 10.6916C27.2557 10.9377 27.9258 12.0983 27.5762 13.1959L26.9668 15.1097C26.9337 15.2137 26.9641 15.3275 27.0449 15.401L28.5295 16.7537C29.381 17.5295 29.381 18.8696 28.5295 19.6455L27.0449 20.9981C26.9641 21.0716 26.9337 21.1854 26.9668 21.2895L27.5762 23.2031C27.9258 24.3009 27.2557 25.4614 26.1304 25.7076L24.1682 26.1366C24.0616 26.1599 23.9782 26.2432 23.955 26.3499L23.5259 28.3119C23.2798 29.4374 22.1192 30.1074 21.0215 29.7578L19.1078 29.1485C19.0037 29.1152 18.8899 29.1458 18.8165 29.2265L17.4638 30.7111C16.6879 31.5627 15.3479 31.5627 14.572 30.7111L13.2193 29.2265C13.1459 29.1458 13.032 29.1152 12.928 29.1485L11.0143 29.7578C9.91664 30.1074 8.75611 29.4374 8.50993 28.3119L8.08085 26.3499C8.05752 26.2432 7.97422 26.1599 7.86756 26.1366L5.90553 25.7076C4.78013 25.4614 4.11008 24.3009 4.45964 23.2031L5.06904 21.2895C5.10216 21.1854 5.07167 21.0716 4.99097 20.9981L3.50635 19.6455C2.65478 18.8696 2.65478 17.5295 3.50635 16.7537L4.99097 15.401C5.07167 15.3275 5.10216 15.2137 5.06904 15.1097L4.45964 13.1959C4.11008 12.0983 4.78013 10.9377 5.90553 10.6916L7.86756 10.2625C7.97422 10.2392 8.05752 10.1559 8.08085 10.0492L8.50993 8.08716C8.75611 6.96177 9.91664 6.29172 11.0143 6.64127L12.928 7.25068C13.032 7.2838 13.1459 7.25331 13.2193 7.17261L14.572 5.68799ZM22.2468 15.1949C22.5467 14.7346 22.6194 14.1382 22.2945 13.6952C21.8947 13.1501 21.3896 12.7689 20.9454 12.5119C20.3424 12.1631 19.6198 12.429 19.2186 12.9985C16.7691 16.4764 15.244 18.734 15.244 18.734C15.244 18.734 14.327 17.5938 12.8023 15.9542C12.2733 15.3854 11.4146 15.2714 10.8286 15.7812C10.5117 16.057 10.1676 16.3972 9.86248 16.7897C9.47267 17.2908 9.55511 17.9845 9.95386 18.4786C11.4617 20.3472 12.918 21.8736 13.9601 22.9008C14.8051 23.7337 16.1288 23.6648 16.8721 22.7399C18.007 21.328 19.8253 18.9102 22.2468 15.1949Z"
                      fill="url(#paint0_linear_3222_12397)"
                    />
                  </g>
                </g>
                <defs>
                  <linearGradient
                    id="paint0_linear_3222_12397"
                    x1="16.0179"
                    y1="5.04931"
                    x2="16.0179"
                    y2="31.3498"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#335FFF" />
                    <stop offset="1" stop-color="#2CC171" />
                  </linearGradient>
                  <clipPath id="clip0_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                  <clipPath id="clip1_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <div className="font-semibold text-xl text-[#09090B]">
              تعزيز التعاون داخل الفريق
            </div>
            <div className="text-center font-normal text-base text-[#3F3F46]">
              ابنِ بيئة عمل أفضل، كل شخص يعرف مسؤولياته ويدرك دوره بوضوح، مما
              يعزّز التعاون والتواصل.{" "}
            </div>
          </div>
          <div className="flex flex-col gap-4 justify-center items-center">
            <div>
              <svg
                width="31"
                height="34"
                viewBox="0 0 31 34"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_3222_12397)">
                  <g clip-path="url(#clip1_3222_12397)">
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M14.572 5.68799C15.3479 4.83643 16.6879 4.83642 17.4638 5.68799L18.8165 7.17261C18.8899 7.25331 19.0037 7.2838 19.1078 7.25068L21.0215 6.64127C22.1192 6.29172 23.2798 6.96176 23.5259 8.08716L23.955 10.0492C23.9782 10.1559 24.0616 10.2392 24.1682 10.2625L26.1304 10.6916C27.2557 10.9377 27.9258 12.0983 27.5762 13.1959L26.9668 15.1097C26.9337 15.2137 26.9641 15.3275 27.0449 15.401L28.5295 16.7537C29.381 17.5295 29.381 18.8696 28.5295 19.6455L27.0449 20.9981C26.9641 21.0716 26.9337 21.1854 26.9668 21.2895L27.5762 23.2031C27.9258 24.3009 27.2557 25.4614 26.1304 25.7076L24.1682 26.1366C24.0616 26.1599 23.9782 26.2432 23.955 26.3499L23.5259 28.3119C23.2798 29.4374 22.1192 30.1074 21.0215 29.7578L19.1078 29.1485C19.0037 29.1152 18.8899 29.1458 18.8165 29.2265L17.4638 30.7111C16.6879 31.5627 15.3479 31.5627 14.572 30.7111L13.2193 29.2265C13.1459 29.1458 13.032 29.1152 12.928 29.1485L11.0143 29.7578C9.91664 30.1074 8.75611 29.4374 8.50993 28.3119L8.08085 26.3499C8.05752 26.2432 7.97422 26.1599 7.86756 26.1366L5.90553 25.7076C4.78013 25.4614 4.11008 24.3009 4.45964 23.2031L5.06904 21.2895C5.10216 21.1854 5.07167 21.0716 4.99097 20.9981L3.50635 19.6455C2.65478 18.8696 2.65478 17.5295 3.50635 16.7537L4.99097 15.401C5.07167 15.3275 5.10216 15.2137 5.06904 15.1097L4.45964 13.1959C4.11008 12.0983 4.78013 10.9377 5.90553 10.6916L7.86756 10.2625C7.97422 10.2392 8.05752 10.1559 8.08085 10.0492L8.50993 8.08716C8.75611 6.96177 9.91664 6.29172 11.0143 6.64127L12.928 7.25068C13.032 7.2838 13.1459 7.25331 13.2193 7.17261L14.572 5.68799ZM22.2468 15.1949C22.5467 14.7346 22.6194 14.1382 22.2945 13.6952C21.8947 13.1501 21.3896 12.7689 20.9454 12.5119C20.3424 12.1631 19.6198 12.429 19.2186 12.9985C16.7691 16.4764 15.244 18.734 15.244 18.734C15.244 18.734 14.327 17.5938 12.8023 15.9542C12.2733 15.3854 11.4146 15.2714 10.8286 15.7812C10.5117 16.057 10.1676 16.3972 9.86248 16.7897C9.47267 17.2908 9.55511 17.9845 9.95386 18.4786C11.4617 20.3472 12.918 21.8736 13.9601 22.9008C14.8051 23.7337 16.1288 23.6648 16.8721 22.7399C18.007 21.328 19.8253 18.9102 22.2468 15.1949Z"
                      fill="url(#paint0_linear_3222_12397)"
                    />
                  </g>
                </g>
                <defs>
                  <linearGradient
                    id="paint0_linear_3222_12397"
                    x1="16.0179"
                    y1="5.04931"
                    x2="16.0179"
                    y2="31.3498"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#335FFF" />
                    <stop offset="1" stop-color="#2CC171" />
                  </linearGradient>
                  <clipPath id="clip0_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                  <clipPath id="clip1_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <div className="font-semibold text-xl text-[#09090B]">
              إنتاجية وتركيز أعلى
            </div>
            <div className="text-center font-normal text-base text-[#3F3F46]">
              الإنجازات أقل من المتوقع؟ ارفع كفاءة فريقك ويعطيك الأدوات لتحقيق
              أفضل أداء ممكن.{" "}
            </div>
          </div>
          <div className="flex flex-col gap-4 justify-center items-center">
            <div>
              <svg
                width="31"
                height="34"
                viewBox="0 0 31 34"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_3222_12397)">
                  <g clip-path="url(#clip1_3222_12397)">
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M14.572 5.68799C15.3479 4.83643 16.6879 4.83642 17.4638 5.68799L18.8165 7.17261C18.8899 7.25331 19.0037 7.2838 19.1078 7.25068L21.0215 6.64127C22.1192 6.29172 23.2798 6.96176 23.5259 8.08716L23.955 10.0492C23.9782 10.1559 24.0616 10.2392 24.1682 10.2625L26.1304 10.6916C27.2557 10.9377 27.9258 12.0983 27.5762 13.1959L26.9668 15.1097C26.9337 15.2137 26.9641 15.3275 27.0449 15.401L28.5295 16.7537C29.381 17.5295 29.381 18.8696 28.5295 19.6455L27.0449 20.9981C26.9641 21.0716 26.9337 21.1854 26.9668 21.2895L27.5762 23.2031C27.9258 24.3009 27.2557 25.4614 26.1304 25.7076L24.1682 26.1366C24.0616 26.1599 23.9782 26.2432 23.955 26.3499L23.5259 28.3119C23.2798 29.4374 22.1192 30.1074 21.0215 29.7578L19.1078 29.1485C19.0037 29.1152 18.8899 29.1458 18.8165 29.2265L17.4638 30.7111C16.6879 31.5627 15.3479 31.5627 14.572 30.7111L13.2193 29.2265C13.1459 29.1458 13.032 29.1152 12.928 29.1485L11.0143 29.7578C9.91664 30.1074 8.75611 29.4374 8.50993 28.3119L8.08085 26.3499C8.05752 26.2432 7.97422 26.1599 7.86756 26.1366L5.90553 25.7076C4.78013 25.4614 4.11008 24.3009 4.45964 23.2031L5.06904 21.2895C5.10216 21.1854 5.07167 21.0716 4.99097 20.9981L3.50635 19.6455C2.65478 18.8696 2.65478 17.5295 3.50635 16.7537L4.99097 15.401C5.07167 15.3275 5.10216 15.2137 5.06904 15.1097L4.45964 13.1959C4.11008 12.0983 4.78013 10.9377 5.90553 10.6916L7.86756 10.2625C7.97422 10.2392 8.05752 10.1559 8.08085 10.0492L8.50993 8.08716C8.75611 6.96177 9.91664 6.29172 11.0143 6.64127L12.928 7.25068C13.032 7.2838 13.1459 7.25331 13.2193 7.17261L14.572 5.68799ZM22.2468 15.1949C22.5467 14.7346 22.6194 14.1382 22.2945 13.6952C21.8947 13.1501 21.3896 12.7689 20.9454 12.5119C20.3424 12.1631 19.6198 12.429 19.2186 12.9985C16.7691 16.4764 15.244 18.734 15.244 18.734C15.244 18.734 14.327 17.5938 12.8023 15.9542C12.2733 15.3854 11.4146 15.2714 10.8286 15.7812C10.5117 16.057 10.1676 16.3972 9.86248 16.7897C9.47267 17.2908 9.55511 17.9845 9.95386 18.4786C11.4617 20.3472 12.918 21.8736 13.9601 22.9008C14.8051 23.7337 16.1288 23.6648 16.8721 22.7399C18.007 21.328 19.8253 18.9102 22.2468 15.1949Z"
                      fill="url(#paint0_linear_3222_12397)"
                    />
                  </g>
                </g>
                <defs>
                  <linearGradient
                    id="paint0_linear_3222_12397"
                    x1="16.0179"
                    y1="5.04931"
                    x2="16.0179"
                    y2="31.3498"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#335FFF" />
                    <stop offset="1" stop-color="#2CC171" />
                  </linearGradient>
                  <clipPath id="clip0_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                  <clipPath id="clip1_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <div className="font-semibold text-xl text-[#09090B]">
              اعمل مع أدواتك المفضلة{" "}
            </div>
            <div className="text-center font-normal text-base text-[#3F3F46]">
              ادعم فِرق الأعمال، مدير مصمّم ليتكيف مع طريقتك في العمل، من إدارة
              المهام اليومية إلى تعزيز التواصل.{" "}
            </div>
          </div>
          <div className="flex flex-col gap-4 justify-center items-center">
            <div>
              <svg
                width="31"
                height="34"
                viewBox="0 0 31 34"
                fill="none"
                xmlns="http://www.w3.org/2000/svg"
              >
                <g clip-path="url(#clip0_3222_12397)">
                  <g clip-path="url(#clip1_3222_12397)">
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M14.572 5.68799C15.3479 4.83643 16.6879 4.83642 17.4638 5.68799L18.8165 7.17261C18.8899 7.25331 19.0037 7.2838 19.1078 7.25068L21.0215 6.64127C22.1192 6.29172 23.2798 6.96176 23.5259 8.08716L23.955 10.0492C23.9782 10.1559 24.0616 10.2392 24.1682 10.2625L26.1304 10.6916C27.2557 10.9377 27.9258 12.0983 27.5762 13.1959L26.9668 15.1097C26.9337 15.2137 26.9641 15.3275 27.0449 15.401L28.5295 16.7537C29.381 17.5295 29.381 18.8696 28.5295 19.6455L27.0449 20.9981C26.9641 21.0716 26.9337 21.1854 26.9668 21.2895L27.5762 23.2031C27.9258 24.3009 27.2557 25.4614 26.1304 25.7076L24.1682 26.1366C24.0616 26.1599 23.9782 26.2432 23.955 26.3499L23.5259 28.3119C23.2798 29.4374 22.1192 30.1074 21.0215 29.7578L19.1078 29.1485C19.0037 29.1152 18.8899 29.1458 18.8165 29.2265L17.4638 30.7111C16.6879 31.5627 15.3479 31.5627 14.572 30.7111L13.2193 29.2265C13.1459 29.1458 13.032 29.1152 12.928 29.1485L11.0143 29.7578C9.91664 30.1074 8.75611 29.4374 8.50993 28.3119L8.08085 26.3499C8.05752 26.2432 7.97422 26.1599 7.86756 26.1366L5.90553 25.7076C4.78013 25.4614 4.11008 24.3009 4.45964 23.2031L5.06904 21.2895C5.10216 21.1854 5.07167 21.0716 4.99097 20.9981L3.50635 19.6455C2.65478 18.8696 2.65478 17.5295 3.50635 16.7537L4.99097 15.401C5.07167 15.3275 5.10216 15.2137 5.06904 15.1097L4.45964 13.1959C4.11008 12.0983 4.78013 10.9377 5.90553 10.6916L7.86756 10.2625C7.97422 10.2392 8.05752 10.1559 8.08085 10.0492L8.50993 8.08716C8.75611 6.96177 9.91664 6.29172 11.0143 6.64127L12.928 7.25068C13.032 7.2838 13.1459 7.25331 13.2193 7.17261L14.572 5.68799ZM22.2468 15.1949C22.5467 14.7346 22.6194 14.1382 22.2945 13.6952C21.8947 13.1501 21.3896 12.7689 20.9454 12.5119C20.3424 12.1631 19.6198 12.429 19.2186 12.9985C16.7691 16.4764 15.244 18.734 15.244 18.734C15.244 18.734 14.327 17.5938 12.8023 15.9542C12.2733 15.3854 11.4146 15.2714 10.8286 15.7812C10.5117 16.057 10.1676 16.3972 9.86248 16.7897C9.47267 17.2908 9.55511 17.9845 9.95386 18.4786C11.4617 20.3472 12.918 21.8736 13.9601 22.9008C14.8051 23.7337 16.1288 23.6648 16.8721 22.7399C18.007 21.328 19.8253 18.9102 22.2468 15.1949Z"
                      fill="url(#paint0_linear_3222_12397)"
                    />
                  </g>
                </g>
                <defs>
                  <linearGradient
                    id="paint0_linear_3222_12397"
                    x1="16.0179"
                    y1="5.04931"
                    x2="16.0179"
                    y2="31.3498"
                    gradientUnits="userSpaceOnUse"
                  >
                    <stop stop-color="#335FFF" />
                    <stop offset="1" stop-color="#2CC171" />
                  </linearGradient>
                  <clipPath id="clip0_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                  <clipPath id="clip1_3222_12397">
                    <rect
                      width="30"
                      height="30"
                      fill="white"
                      transform="translate(0.649902 3.2002)"
                    />
                  </clipPath>
                </defs>
              </svg>
            </div>
            <div className="font-semibold text-xl text-[#09090B]">
              اتخاذ قرارات أفضل{" "}
            </div>
            <div className="text-center font-normal text-base text-[#3F3F46]">
              ارسم خططك وأهدافك بثقة ووضوح مع تقارير وتحليلات دقيقة تمنحك رؤية
              واضحة لإنجازاتك وأهدافك.
            </div>
          </div>
        </div>
      </div>
      <Questions />
    </div>
  );
}
